---
kind: method
id: M:Autodesk.Revit.DB.EvaluatedParameter.Dispose
source: html/691ff72a-b020-1cbe-db76-456b3dc2302a.htm
---
# Autodesk.Revit.DB.EvaluatedParameter.Dispose Method

Releases all resources used by the EvaluatedParameter

## Syntax (C#)
```csharp
public void Dispose()
```